logs/Test-3/Google/oltp_delete.log
sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           12079
        other:                           46925
        total:                           59004
    transactions:                        59004  (5896.57 per sec.)
    queries:                             59004  (5896.57 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0046s
    total number of events:              59004

Latency (ms):
         min:                                  0.28
         avg:                                  1.36
         max:                                 25.18
         95th percentile:                      5.37
         sum:                              79969.03

Threads fairness:
    events (avg/stddev):           7375.5000/66.54
    execution time (avg/stddev):   9.9961/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           16933
        other:                           149863
        total:                           166796
    transactions:                        166796 (16670.55 per sec.)
    queries:                             166796 (16670.55 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0038s
    total number of events:              166796

Latency (ms):
         min:                                  0.28
         avg:                                  0.96
         max:                                 54.93
         95th percentile:                      5.37
         sum:                             159892.19

Threads fairness:
    events (avg/stddev):           10424.7500/287.78
    execution time (avg/stddev):   9.9933/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           18014
        other:                           446964
        total:                           464978
    transactions:                        464978 (46464.49 per sec.)
    queries:                             464978 (46464.49 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0055s
    total number of events:              464978

Latency (ms):
         min:                                  0.28
         avg:                                  0.69
         max:                                201.76
         95th percentile:                      0.78
         sum:                             319770.64

Threads fairness:
    events (avg/stddev):           14530.5625/431.94
    execution time (avg/stddev):   9.9928/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           17797
        other:                           824137
        total:                           841934
    transactions:                        841934 (84133.39 per sec.)
    queries:                             841934 (84133.39 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0055s
    total number of events:              841934

Latency (ms):
         min:                                  0.29
         avg:                                  0.76
         max:                                 74.34
         95th percentile:                      1.30
         sum:                             639633.08

Threads fairness:
    events (avg/stddev):           13155.2188/1388.08
    execution time (avg/stddev):   9.9943/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           17073
        other:                           857842
        total:                           874915
    transactions:                        874915 (87381.81 per sec.)
    queries:                             874915 (87381.81 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0109s
    total number of events:              874915

Latency (ms):
         min:                                  0.31
         avg:                                  1.46
         max:                                 58.61
         95th percentile:                      5.18
         sum:                            1279594.93

Threads fairness:
    events (avg/stddev):           6835.2734/786.95
    execution time (avg/stddev):   9.9968/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 256
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           11204
        other:                           548683
        total:                           559887
    transactions:                        559887 (55809.95 per sec.)
    queries:                             559887 (55809.95 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0304s
    total number of events:              559887

Latency (ms):
         min:                                  0.32
         avg:                                  4.58
         max:                                 83.36
         95th percentile:                     18.61
         sum:                            2562218.79

Threads fairness:
    events (avg/stddev):           2187.0586/104.86
    execution time (avg/stddev):   10.0087/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 512
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           6153
        other:                           292341
        total:                           298494
    transactions:                        298494 (29662.06 per sec.)
    queries:                             298494 (29662.06 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0615s
    total number of events:              298494

Latency (ms):
         min:                                  0.34
         avg:                                 17.17
         max:                                304.11
         95th percentile:                     48.34
         sum:                            5126319.12

Threads fairness:
    events (avg/stddev):           582.9961/23.44
    execution time (avg/stddev):   10.0123/0.01